// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//void ThirdDigit() 
    Console.WriteLine("input any number: " );
    
